
// 1  Дан массив ['a', 'b', 'c']. Добавьте ему в конец элементы 1, 2, 3.
// let arr = ['1','2','3']
// arr.push(1,2,3)
// console.log(arr)

// 2 Даны два массива: [1, 2, 3] и [4, 5, 6]. Объедините их вместе.
// let arr1 = [1,2,3],arr2 = [4,5,6]
// arr2.push()
// console.log(arr1,arr2)

// 3 Дан массив [1, 2, 3]. Добавьте ему в конец элементы 4, 5, 6.
// let arr = [1,2,3]
// arr.push(4,5,6)
// console.log(arr)

// 4 Дан массив [1, 2, 3]. Добавьте ему в начало элементы 4, 5, 6.
// let arr = [1,2,3]
// arr.unshift(4,5,6)
// console.log(arr)

// 5 Дан массив ['js', 'css', 'jq']. Выведите на экран первый элемент.
// let arr = ['js','css','gh']
// arr.splice(1)
// console.log(arr)
// console.log(arr.splice(1,1))

// 6 Дан массив ['js', 'css', 'scss']. Выведите на экран последний элемент.
// let arr = ["js","css","scss"]
// let ab = arr.pop()
// console.log(ab)

// 7  Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в
// новый элементы [1, 2, 3].
// let arr = [1,2,3,4,5]
// console.log(arr.slice(0,3))

// 8  Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый
// элементы [4, 5].
// let arr = [1,2,3,4,5]
// console.log(arr.slice(3))

// 9  Дан массив [1, 2, 3, 4, 5]. С помощью метода splice преобразуйте
// массив в [1, 4, 5].
// let arr =[1,2,3,4,5]
// arr.splice(1,2)
// console.log(arr)

// 10  Дан массив [1, 2, 3, 4, 5]. С помощью метода splice запишите в
// новый массив элементы [2, 3, 4].
// let arr = [1,2,3,4,5]
// arr.splice(0,1)
// arr.splice(3,1)
// console.log(arr)

// 11  Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него
// массив [1, 2, 3, 'a', 'b', 'c', 4, 5].
// let arr = [1,2,3,4,5]
// arr.splice(2,0,'a','b','c',)
// console.log(arr)

// 12  Дан массив [1, 2, 3, 4, 5]. С помощью метода splice
// сделайте из него массив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
// let arr = [1,2,3,4,5]
// arr.splice(1,0,'a','b')
// arr.splice(6,0,'c')
// arr.splice(8,0,'e')
// console.log(arr)
////////////////////////////////////////
// let arr = ['adm2','adm3','adm4',['beka','adm1'],'adm6',]
// console.log(arr[3][0])

// flat()
// let arr = ["fgh","fgh",["fgh",["efd","fgh"],"fgh"]]
// console.log(arr.flat(2))

                            //metod massif
//split
//join
// .map()
////////////////
// let arr = [22,33,44,33,5,5,6,6,54,,4]
// arr = arr.filter((item)=>{
//     return item > 20
// })
// console.log(arr)

// let arr = ['beka','beka2','beka3','beka3']
// arr = arr.map((el,index)=>{
//     if(index % 2 !== 0){
//         return el.toUpperCase()
//     }else{
//         return el
//     }
// })
// console.log(arr)

// let arr = [1,2,3,4,5,6,7,8]
// function task(a){
//     return a.map((el)=>{
//         if(el % 2 === 0){
//             return "jup"
//         }else{
//             return "tak"
//         }
//     })
// }
// console.log(task(arr))


// 1. Вам дан массив: [315, 64, 75, 43, 65, 63].Найдите сумму каждого числа.
// let arr = [315, 64, 75, 43, 65, 63]
// console.log(arr.map((el)=>{
//     return el + el
// }))
// 2. Вам дан массив: ['Аскар', 'Баяман', 'Калмамат']. Создайте функцию,
// изменяющую букву а в каждом имени на я и выведите в консоль.

// 3. Вам дан массив: ['Аскар', 'Баяман', 'Калмамат']. Создайте функцию,
// которая выводит только те имена, где есть буква к и выведите в консоль.
// function task(array){
//     return array.filter((el)=>{
//         return el.includes("к")
//     })
// }
// console.log(task(['Аскар', 'Баяман', 'Калмамат']))

// 4. Вам дан массив: [4, 54, 49]. Сделайте из него массив, состоящий из квадратов этих чисел.
// let arr = [4, 54, 49]
// console.log(arr.map((el)=>{
//     return el * 2
// }))

// 5. Вам дан массив [3134, 4, -143, -245, -214]. Оставьте в нем только отрицательные числа.
// let arr = [3134, 4, -143, -245, -214]
// console.log(arr.filter((el)=>{
//     return el < 0
// }))

// 6. Вам дан массив [3, 51, 30, 54, 60]. Оставьте в нем только четные числа.
// let arr = [3, 51, 30, 54, 60]
// console.log(arr.filter((el)=>{
//     return el % 2 === 0
// }))

// 7. Вам дан массив ['Бегимай', 'Баяман', 'Калмама/т']. Оставьте в нем только
// те строки, длина которых больше 5-ти символов.
// let arr = ['Бегимай', 'Баяман', 'Калмама/т']
// console.log(arr.filter((el)=>{
//     return el.length > 6
// }))
// 8. Вам дан массив [-13, 96, -41, -28, 40]. Посчитайте количество отрицательных чисел в этом массиве.

// let arr = [-13, 96, -41, -28, 40]
// console.log(arr.filter((el,index)=>{
//    if(el < 0){
//        console.log(el,index)
//    }
// }))
// 9. Вам дан массив [3, 51, -30, -54, 60]. Оставьте в нем только положительные числа.
// Затем извлеките квадратный корень из этих чисел, если эти числа больше 30.
// let arr = [3, 64, -30, -54, 64]
// console.log(arr.filter((el)=>{
//     if(el > 30 ){
//         console.log(Math.sqrt(el))
//     }
// }))
// 10. Вам дан массив [55, 44, 55, 44, 15, 49]. Оставьте в нем только неповторяющиеся числа.
// let arr = [55, 44, 55, 44, 15, 49]
// arr = arr.filter((el,index,array)=> array.indexOf(el) === index)
// console.log(arr)

// 11. Вам дан массив [NaN, 0, 77, false, -17, '',undefined, 99, null]. Создайте функцию,
// которая очищает массив от ложных (false) значений: false, null, undefined, 0, –0, NaN и "" (пустая строка).
// 12. Вам дан массив ['Бегимай', 'Баяман', 'Калмамат']. Выведите длину каждой строки.
// let arr = ['Бегимай', 'Баяман', 'Калмамат']
// console.log(arr.map((el)=>{
//     return el.length
// }))